13/data/attachments/ca0fb3e68ad01a48.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_8693f88a-5ee4-4331-a397-568dcd01b40b</nif:username>
            <nif:friendToBeAdded>Krystal_physical_Friend_59208_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>